
#####  用命令行启动python：
#
#启动python：下载完python后，在命令提示符(cmd)中输入python，回车，即可进入python解释器。
#命令行中显示你所下载的python版本，则成功进入了。
#【注：windows+r可调出搜索框，搜cmd打开命令提示符】
#退出python：exit()  ，或者关掉命令行重开





#####  python解释器：
# python代码 -> python解释器 ->(翻译)-> 01101(二进制) -> 执行
#
#安装python环境，本质上使在电脑中安装python解释器；
# python解释器的功能（1.翻译代码 2.提交给计算机运行）
#
#用命令行启动的python解释器内，只允许执行单行代码，当结束一行后回车换行，自动执行本行代码




#####  使用python解释器程序，执行.py代码文件
#
#我们发现直接进入python解释器只能一次执行一行代码内容，若想一次执行多条语句，需要用解释器执行包含多行代码的.py文件。
#
#Python解释器直接执行.py文件步骤如下：
#（1.在文本文档中输入想要执行的语句【注意文档后缀为 .py】
#（2.进入控制行，输入 ”python C:\xxxx\test.py(代码路径)“




#####  PyCharm基础使用
#
#（1.插件：下载相关插件可为PyCharm添加 中文包、翻译 等功能
#（2.齿轮按钮中可修改黑白主题
#（3.自定义快捷键：设置中按键映射可供自定义各操作的快捷键，如可为 放大\缩小字体 添加 ctrl+滚轮 的快捷操作
#
#（4.常用快捷键如下：
#·ctrl+alt+s：打开设置栏
#·ctrl+d：复制当前行代码
#·shift+alt+上\下：将当前行代码上\下移一行
#·ctrl+shift+f10：运行当前代码文件
#·shift+f6：重命名文件
#·ctrl+a：全选
#·ctrl+c\v\x：复制、粘贴、剪切
#·ctrl+f：搜索